# Дано целое число A. Проверить истинность высказывания: Число А является положительным».

print('Проверка истинности высказывания "А является положительным".')

A = int(input('Введите A > '))

condition = A > 0

print(condition)